<?xml version="1.0" encoding="UTF-8"?><!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1"><dict><key>PayloadUUID</key><string>17457324-EBF2-4CA7-ABA7-44DD08A2AB17</string><key>PayloadType</key><string>Configuration</string><key>PayloadOrganization</key><string>Bath and Body Works</string><key>PayloadIdentifier</key><string>17457324-EBF2-4CA7-ABA7-44DD08A2AB17</string><key>PayloadDisplayName</key><string>Nudge - macOS Update Managment - 12.4</string><key>PayloadDescription</key><string>Configures Nudge to company standards</string><key>PayloadVersion</key><integer>1</integer><key>PayloadEnabled</key><true/><key>PayloadRemovalDisallowed</key><true/><key>PayloadScope</key><string>System</string><key>PayloadContent</key><array><dict><key>PayloadDisplayName</key><string>Custom Settings</string><key>PayloadIdentifier</key><string>C02C52CB-3F98-42BB-B818-A882F79D80CC</string><key>PayloadOrganization</key><string>JAMF Software</string><key>PayloadType</key><string>com.apple.ManagedClient.preferences</string><key>PayloadUUID</key><string>C02C52CB-3F98-42BB-B818-A882F79D80CC</string><key>PayloadVersion</key><integer>1</integer><key>PayloadContent</key><dict><key>com.github.macadmins.nudge</key><dict><key>Forced</key><array><dict><key>mcx_preference_settings</key><dict><key>osVersionRequirements</key><array><dict><key>aboutUpdateURL</key><string>https://support.apple.com/en-us/HT212585</string><key>requiredInstallationDate</key><string>2022-06-16T00:00:01Z</string><key>requiredMinimumOSVersion</key><string>12.4</string><key>targetedOSVersionsRule</key><string>12</string></dict><dict><key>aboutUpdateURL</key><string>https://support.apple.com/en-us/HT212585</string><key>requiredInstallationDate</key><string>2022-06-16T00:00:01Z</string><key>requiredMinimumOSVersion</key><string>12.4</string><key>targetedOSVersionsRule</key><string>11</string></dict></array><key>optionalFeatures</key><dict><key>acceptableCameraUsage</key><true/><key>acceptableScreenSharingUsage</key><true/><key>aggressiveUserExperience</key><true/><key>asynchronousSoftwareUpdate</key><true/><key>attemptToBlockApplicationLaunches</key><true/><key>attemptToFetchMajorUpgrade</key><true/><key>enforceMinorUpdates</key><true/><key>blockedApplicationBundleIDs</key><array><string>com.adobe.Photoshop</string><string>com.adobe.illustrator</string><string>com.adobe.indesign</string><string>com.adobe.acc.AdobeCreativeCloud</string><string>com.adobe.Acrobat.Pro</string><string>com.adobe.Acrobat</string><string>com.apple.Keynote</string><string>com.apple.Xcode</string><string>com.autodesk.AutoCAD</string><string>com.github.GitHub</string><string>com.google.Chrome</string><string>com.apple.Safari</string><string>org.mozilla.firefox</string><string>com.vivaldi.Vivaldi</string><string>org.eclipse.eclipse</string><string>com.spotify.client</string><string>com.panic.Transmit</string><string>com.operasoftware.Opera</string><string>com.microsoft.Word</string><string>com.microsoft.Powerpoint</string><string>com.microsoft.onenote.mac</string><string>com.microsoft.Excel</string><string>com.google.sketchuppro</string><string>com.apple.iWork.Pages</string><string>com.apple.iWork.Numbers</string><string>com.apple.iPhoto</string><string>com.apple.Music</string><string>com.brave.Browser</string><string>org.torproject.torbrowser</string><string>com.pandora.desktop</string><string>com.microsoft.edgemac</string><string>com.apple.Terminal</string><string>com.apple.ActivityMonitor</string><string>com.postmanlabs.mac</string><string>com.oracle.workbench.MySQLWorkbench</string><string>com.extensis.UniversalTypeClient</string><string>com.microsoft.VSCode</string><string>com.tinyspeck.slackmacgap</string><string>com.apple.FaceTime</string><string>com.apple.configurator.ui</string><string>com.hnc.Discord</string></array></dict><key>userExperience</key><dict><key>allowGracePeriods</key><true/><key>allowUserQuitDeferrals</key><true/><key>allowedDeferrals</key><integer>10</integer><key>allowedDeferralsUntilForcedSecondaryQuitButton</key><integer>5</integer><key>approachingRefreshCycle</key><integer>6000</integer><key>approachingWindowTime</key><integer>72</integer><key>elapsedRefreshCycle</key><integer>300</integer><key>gracePeriodInstallDelay</key><integer>24</integer><key>gracePeriodLaunchDelay</key><integer>4</integer><key>gracePeriodPath</key><string>/private/var/db/.AppleSetupDone</string><key>imminentRefreshCycle</key><integer>300</integer><key>imminentWindowTime</key><integer>48</integer><key>initialRefreshCycle</key><integer>7200</integer><key>maxRandomDelayInSeconds</key><integer>1200</integer><key>randomDelay</key><true/></dict><key>userInterface</key><dict><key>iconLightPath</key><string>/Applications/Install macOS Monterey.app/Contents/Resources/InstallAssistant.icns</string><key>showDeferralCount</key><true/><key>simpleMode</key><false/><key>singleQuitButton</key><false/><key>updateElements</key><array><dict><key>actionButtonText</key><string>Update My Mac</string><key>customDeferralDropdownText</key><string>Remind Me Later</string><key>mainContentHeader</key><string>Your Mac may need to reboot in order to complete update installation.</string><key>mainContentSubHeader</key><string>Updates may take up to 30-45 minutes to install</string><key>mainHeader</key><string>macOS Monterey 12.4 update required</string><key>primaryQuitButtonText</key><string>Remind Me Later</string><key>secondaryQuitButtonText</key><string>I understand</string><key>subHeader</key><string>A friendly reminder from IT</string></dict></array></dict></dict></dict></array></dict></dict></dict></array></dict></plist>